zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_I3C.h
#define I3C_SERRWARN_URUNNACK_MASK               (0x4U)
#define I3C_SERRWARN_URUNNACK_SHIFT              (2U)
/*! URUNNACK - Underrun and Not Acknowledged (NACKed) Error Flag
 *  0b0..No effect
 *  0b0..No underrun; not acknowledged error
 *  0b1..Clear the flag
 *  0b1..Underrun; not acknowledged error
 */
#define I3C_SERRWARN_URUNNACK(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_URUNNACK_SHIFT)) & I3C_SERRWARN_URUNNACK_MASK)

#define I3C_SERRWARN_TERM_MASK                   (0x8U)
#define I3C_SERRWARN_TERM_SHIFT                  (3U)
/*! TERM - Terminated Error Flag
 *  0b0..No effect
 *  0b0..No terminated error
 *  0b1..Clear the flag
 *  0b1..Terminated error
 */
#define I3C_SERRWARN_TERM(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_TERM_SHIFT)) & I3C_SERRWARN_TERM_MASK)

#define I3C_SERRWARN_INVSTART_MASK               (0x10U)
#define I3C_SERRWARN_INVSTART_SHIFT              (4U)
/*! INVSTART - Invalid Start Error Flag
 *  0b0..No effect
 *  0b0..No invalid start error
 *  0b1..Clear the flag
 *  0b1..Invalid start error
 */
#define I3C_SERRWARN_INVSTART(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_INVSTART_SHIFT)) & I3C_SERRWARN_INVSTART_MASK)

#define I3C_SERRWARN_SPAR_MASK                   (0x100U)
#define I3C_SERRWARN_SPAR_SHIFT                  (8U)
/*! SPAR - SDR Parity Error Flag
 *  0b0..No SDR parity error
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..SDR parity error
 */
#define I3C_SERRWARN_SPAR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_SPAR_SHIFT)) & I3C_SERRWARN_SPAR_MASK)

#define I3C_SERRWARN_HPAR_MASK                   (0x200U)
#define I3C_SERRWARN_HPAR_SHIFT                  (9U)
/*! HPAR - HDR Parity Error Flag
 *  0b0..No HDR parity error
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..HDR parity error
 */
#define I3C_SERRWARN_HPAR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_HPAR_SHIFT)) & I3C_SERRWARN_HPAR_MASK)

#define I3C_SERRWARN_HCRC_MASK                   (0x400U)
#define I3C_SERRWARN_HCRC_SHIFT                  (10U)
/*! HCRC - HDR-DDR CRC Error Flag
 *  0b0..No HDR-DDR CRC error occurred
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..HDR-DDR CRC error occurred
 */
#define I3C_SERRWARN_HCRC(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_HCRC_SHIFT)) & I3C_SERRWARN_HCRC_MASK)

#define I3C_SERRWARN_S0S1_MASK                   (0x800U)
#define I3C_SERRWARN_S0S1_SHIFT                  (11U)
/*! S0S1 - TE0 or TE1 Error Flag
 *  0b0..No TE0 or TE1 error occurred
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..TE0 or TE1 error occurred
 */
#define I3C_SERRWARN_S0S1(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_S0S1_SHIFT)) & I3C_SERRWARN_S0S1_MASK)

#define I3C_SERRWARN_HNOVERIFY_MASK              (0x1000U)
#define I3C_SERRWARN_HNOVERIFY_SHIFT             (12U)
/*! HNOVERIFY - HDR-BT Not Verified Flag
 *  0b0..No HDR-BT not verified error
 *  0b0..No effect
 *  0b1..Clear the flag
 *  0b1..HDR-BT not verified error
 */
#define I3C_SERRWARN_HNOVERIFY(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_HNOVERIFY_SHIFT)) & I3C_SERRWARN_HNOVERIFY_MASK)

#define I3C_SERRWARN_OREAD_MASK                  (0x10000U)
#define I3C_SERRWARN_OREAD_SHIFT                 (16U)
/*! OREAD - Over-Read Error Flag
 *  0b0..No effect
 *  0b0..No over-read error
 *  0b1..Clear the flag
 *  0b1..Over-read error
 */
#define I3C_SERRWARN_OREAD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_OREAD_SHIFT)) & I3C_SERRWARN_OREAD_MASK)

#define I3C_SERRWARN_OWRITE_MASK                 (0x20000U)
#define I3C_SERRWARN_OWRITE_SHIFT                (17U)
/*! OWRITE - Over-Write Error Flag
 *  0b0..No effect
 *  0b0..No overwrite error
 *  0b1..Clear the flag
 *  0b1..Overwrite error
 */
#define I3C_SERRWARN_OWRITE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_OWRITE_SHIFT)) & I3C_SERRWARN_OWRITE_MASK)

#define I3C_SERRWARN_WRONGSIZE_MASK              (0x200000U)
#define I3C_SERRWARN_WRONGSIZE_SHIFT             (21U)
/*! WRONGSIZE - Wrong Size Flag
 *  0b0..No effect
 *  0b0..No wrong-size error
 *  0b1..Clear the flag
 *  0b1..Wrong-size error
 */
#define I3C_SERRWARN_WRONGSIZE(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SERRWARN_WRONGSIZE_SHIFT)) & I3C_SERRWARN_WRONGSIZE_MASK)
/*! @} */

/*! @name SDMACTRL - Target DMA Control */
/*! @{ */

#define I3C_SDMACTRL_DMAFB_MASK                  (0x3U)
#define I3C_SDMACTRL_DMAFB_SHIFT                 (0U)
/*! DMAFB - DMA Read (From-Bus) Trigger
 *  0b00..DMA not used
 *  0b01..DMA enabled for one frame
 *  0b10..DMA enabled until turned off
 *  0b11..
 */
#define I3C_SDMACTRL_DMAFB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SDMACTRL_DMAFB_SHIFT)) & I3C_SDMACTRL_DMAFB_MASK)

#define I3C_SDMACTRL_DMATB_MASK                  (0xCU)
#define I3C_SDMACTRL_DMATB_SHIFT                 (2U)
/*! DMATB - DMA Write (To-Bus) Trigger
 *  0b00..DMA not used
 *  0b01..DMA enabled for one frame
 *  0b10..DMA enabled until turned off
 *  0b11..
 */
#define I3C_SDMACTRL_DMATB(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_SDMACTRL_DMATB_SHIFT)) & I3C_SDMACTRL_DMATB_MASK)

#define I3C_SDMACTRL_DMAWIDTH_MASK               (0x30U)
#define I3C_SDMACTRL_DMAWIDTH_SHIFT              (4U)
/*! DMAWIDTH - Width of DMA Operations
 *  0b00, 0b01..Byte
 *  0b10..Halfword (16 bits) (this value ensures that two bytes are available in the FIFO)
 *  0b11..
 */
#define I3C_SDMACTRL_DMAWIDTH(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_SDMACTRL_DMAWIDTH_SHIFT)) & I3C_SDMACTRL_DMAWIDTH_MASK)
/*! @} */

/*! @name SHDRBTCFG - Target HDR-BT Configuration */
/*! @{ */

#define I3C_SHDRBTCFG_CRC32_MASK                 (0x4U)
#define I3C_SHDRBTCFG_CRC32_SHIFT                (2U)
/*! CRC32 - CRC32 Select
 *  0b0..CRC16
 *  0b1..CRC32
 */
#define I3C_SHDRBTCFG_CRC32(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SHDRBTCFG_CRC32_SHIFT)) & I3C_SHDRBTCFG_CRC32_MASK)

#define I3C_SHDRBTCFG_WDATAMAX_MASK              (0xFFF0U)
#define I3C_SHDRBTCFG_WDATAMAX_SHIFT             (4U)
/*! WDATAMAX - Maximum Data */
#define I3C_SHDRBTCFG_WDATAMAX(x)                (((uint32_t)(((uint32_t)(x)) << I3C_SHDRBTCFG_WDATAMAX_SHIFT)) & I3C_SHDRBTCFG_WDATAMAX_MASK)

